kOmegaSST/PlasmaRegionOff/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $turbulentViscosity;

boundaryField
{
  
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
	value		uniform 0;
    }

    topAndBottom
    {
        type            calculated;
	value		uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    
    naca0012
    {
        type            calculated;
	value		uniform 0;
    }
}


// ************************************************************************* //
